<?php
echo "<h3>--- โปรแกรมเช็คการซื้อของของนายสมชาย (if...elseif...else) ---</h3>";


$money = 850; 

echo "นายสมชาย ใจดี มีเงินทั้งหมด: " . $money . " บาท<br>";
echo "ผลลัพธ์: ";

if ($money < 500) {
    
    echo "เขาจะสามารถซื้อกางเกงได้";
    
} elseif ($money < 1000) {
    
    echo "เขาจะสามารถซื้อกางเกงและเสื้อได้";
    
} elseif ($money < 1500) {
    
    echo "สามารถซื้อกางเกง เสื้อ และรองเท้าได้";
    
} else {
    
    echo "เขาจะสามารถซื้อได้ทุกอย่าง และมีเงินเหลือๆ เลย!";
}
?>